goalsapp/app/models/user.rb

    def self.find_by_credentials
        user = User.find_by(username: :username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "username"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = generate_session_token
        self.save!
---
UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2021-06-02 20:38:31.417966"], ["session_token", "KcnpfkYBEf_pyZha9LhRzg"], ["id", 1]]